{"_id":{"$oid":"62ca1db901b7ab6c754ebdde"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"62ca22b001b7ab6c754ebddf"},"Title":"Harry Potter and the Sorcerer's Stone","Description":"Its story follows Harry''s first year at Hogwarts School of Witchcraft and Wizardry as he discovers that he is a famous wizard and begins his formal wizarding education.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Chris Columbus","Bio":"American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"1958"},"ImagePath":"HarryPotter1.png","Featured":true}
{"_id":{"$oid":"62ca2a4601b7ab6c754ebde0"},"Title":"Harry Potter and the Chamber of Secrets","Description":"The story follows Harry''s second year at Hogwarts School of Witchcraft and Wizardry, where the Heir of Salazar Slytherin opens the Chamber of Secrets, unleashing a monster that petrifies the school's students.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Chris Columbus","Bio":"American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"1958"},"ImagePath":"HarryPotter2.png","Featured":true}
{"_id":{"$oid":"62ca2a4e01b7ab6c754ebde1"},"Title":"Harry Potter and the Prisoner of Azkaban","Description":"The film follows Harry''s third year at Hogwarts and his quest to uncover the truth about his past, including the connection recently-escaped Azkaban prisoner Sirius Black has to Harry and his late parents.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Chris Columbus","Bio":"American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"1958"},"ImagePath":"HarryPotter3.png","Featured":true}
{"_id":{"$oid":"62ca2a5201b7ab6c754ebde2"},"Title":"Harry Potter and the Goblet of Fire","Description":"Its story follows Harry''s fourth year at Hogwarts as he is chosen by the Goblet of Fire to compete in the Triwizard Tournament.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"Chris Columbus","Bio":"American filmmaker. Born in Spangler, Pennsylvania, Columbus studied film at Tisch School of the Arts where he developed an interest in filmmaking.","Birth":"1958"},"ImagePath":"HarryPotter4.png","Featured":true}
{"_id":{"$oid":"62ca2a5601b7ab6c754ebde3"},"Title":"Harry Potter and the Order of the Phoenix","Description":" Its story follows Harry's fifth year at Hogwarts School of Witchcraft and Wizardry as the Ministry of Magic is in denial of Lord Voldemort's return.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"David Yates","Bio":"More info to come","Birth":"1963"},"ImagePath":"HarryPotter5.png","Featured":true}
{"_id":{"$oid":"62ca2a5a01b7ab6c754ebde4"},"Title":"Green Book","Description":" Starring Viggo Mortensen and Mahershala Ali, the film is inspired by the true story of a 1962 tour of the Deep South by African-American pianist Don Shirley and Italian-American bouncer and later actor Frank 'Tony Lip' Vallelonga, who served as Shirley's driver and bodyguard.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Peter Farrelly","Bio":"Peter John Farrelly is an American film director, screenwriter, producer and novelist.","Birth":"1956"},"ImagePath":"greenbook.png","Featured":true}
{"_id":{"$oid":"62ca2a5e01b7ab6c754ebde5"},"Title":"Harry Potter and the Deathly Hallows: Part 2","Description":"Update TBD","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"David Yates","Bio":"More info to come","Birth":"1963"},"ImagePath":"HarryPotter75.png","Featured":true}
{"_id":{"$oid":"62ca2a6001b7ab6c754ebde6"},"Title":"Harry Potter and the Deathly Hallows: Part 1","Description":"As Harry, Ron, and Hermione race against time and evil to destroy the Horcruxes, they uncover the existence of the three most powerful objects in the wizarding world: the Deathly Hallows.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"David Yates","Bio":"More info to come","Birth":"1963"},"ImagePath":"HarryPotter7.png","Featured":true}
{"_id":{"$oid":"62ca2a6601b7ab6c754ebde7"},"Title":"Harry Potter and the Half-Blood Prince","Description":"The story follows Harry's sixth year at Hogwarts as he receives a mysterious textbook, falls in love, and attempts to retrieve a memory that holds the key to Lord Voldemort's downfall.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction involving magical elements, typically set in a fictional universe and sometimes inspired by mythology and folklore."},"Director":{"Name":"David Yates","Bio":"More info to come","Birth":"1963"},"ImagePath":"HarryPotter6.png","Featured":true}
{"_id":{"$oid":"62d6ec1b20613873b1d4edea"},"Title":"The Intouchables","Description":"A Parisian aristocrat, quadriplegic since a paragliding accident, hires a young man to be his live-in caretaker. Although very different the two men bond and develop a close friendship.","Genre":{"Name":"Comedy","Description":"Comedy is a genre of film in which the main emphasis is on humor. These films are designed to make the audience laugh through amusement and most often work by exaggerating characteristics for humorous effect."},"Director":{"Name":"Olivier Nakache","Bio":"Olivier Nakache (born 15 April 1973) and Éric Toledano (born 3 July 1971) are French filmmakers, best known for directing the films Those Happy Days and The Intouchables.","Birth":"1973"},"ImagePath":"the_intouchables.png","Featured":true}
{"_id":{"$oid":"62d6ec1b20613873b1d4edeb"},"Title":"Hachiko: A Dog''s Story","Description":"Young Ronnie reveals to his classmates that his personal hero is a dog named Hachi. Ribbed by his fellow pupils, Ronnie goes on to tell the remarkable story of his grandfather's friendship with the dog.","Genre":{"Name":"Drama","Description":"The drama genre features stories with high stakes and a lot of conflicts. They're plot-driven and demand that every character and scene move the story forward."},"Director":{"Name":"Lasse Hallström","Bio":"Lars Sven ''Lasse'' Hallström is a Swedish film director. He first became known for directing almost all the music videos by the pop group ABBA, and subsequently became a feature film director.","Birth":"1946"},"ImagePath":"Hachiko.png","Featured":true}
{"_id":{"$oid":"62d6ec1b20613873b1d4edec"},"Title":"Avatar","Description":"On the lush alien world of Pandora live the Na''vi, beings who appear primitive but are highly evolved. Because the planet''s environment is poisonous, human/Na''vi hybrids, called Avatars, must link to human minds to allow for free movement on Pandora. Jake Sully (Sam Worthington), a paralyzed former Marine, becomes mobile again through one such Avatar and falls in love with a Na''vi woman (Zoe Saldana). As a bond with her grows, he is drawn into a battle for the survival of her world.","Genre":{"Name":"Sci-fi","Description":"Science fiction (sometimes shortened to sci-fi or SF) is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, extraterrestrial life, sentient artificial intelligence, cybernetics, certain forms of immortality (like mind uploading), and the singularity. It has been called the ''literature of ideas'', and it often explores the potential consequences of scientific, social, and technological innovations."},"Director":{"Name":"James Cameron","Bio":"James Francis Cameron CC is a Canadian filmmaker. Best known for making science fiction and epic films, he first gained recognition for directing The Terminator. He found further success with Aliens, The Abyss, Terminator 2: Judgment Day, and the action comedy True Lies.","Birth":"1954"},"ImagePath":"Avatar.png","Featured":true}
{"_id":{"$oid":"62d6ec1b20613873b1d4eded"},"Title":"Avatar: The Way of Water","Description":"Jake Sully and Ney''tiri have formed a family and are doing everything to stay together. However, they must leave their home and explore the regions of Pandora. When an ancient threat resurfaces, Jake must fight a difficult war against the humans.","Genre":{"Name":"Sci-fi","Description":"Science fiction (sometimes shortened to sci-fi or SF) is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, extraterrestrial life, sentient artificial intelligence, cybernetics, certain forms of immortality (like mind uploading), and the singularity. It has been called the ''literature of ideas'', and it often explores the potential consequences of scientific, social, and technological innovations."},"Director":{"Name":"James Cameron","Bio":"James Francis Cameron CC is a Canadian filmmaker. Best known for making science fiction and epic films, he first gained recognition for directing The Terminator. He found further success with Aliens, The Abyss, Terminator 2: Judgment Day, and the action comedy True Lies.","Birth":"1954"},"ImagePath":"Avatar2.png","Featured":false}
{"_id":{"$oid":"62d6efbe20613873b1d4edee"},"Title":"2012","Description":"Earth''s billions of inhabitants are unaware that the planet has an expiration date. With the warnings of an American scientist (Chiwetel Ejiofor), world leaders begin secret preparations for the survival of select members of society. When the global cataclysm finally occurs, failed writer Jackson Curtis (John Cusack) tries to lead his family to safety as the world starts falling apart.","Genre":{"Name":"Sci-fi","Description":"Science fiction is a genre of speculative fiction which typically deals with imaginative and futuristic concepts such as advanced science and technology, space exploration, time travel, parallel universes, extraterrestrial life, sentient artificial intelligence, cybernetics, certain forms of immortality (like mind uploading), and the singularity. It has been called the ''literature of ideas'', and it often explores the potential consequences of scientific, social, and technological innovations."},"Director":{"Name":"Roland Emmerich","Bio":"Roland Emmerich is a German film director, screenwriter, and producer. He is widely known for his science fiction and disaster films and has been called a ''master of disaster'' within the industry.","Birth":"1955"},"ImagePath":"2012.png","Featured":true}
{"_id":{"$oid":"62d6efbe20613873b1d4edef"},"Title":"Rush Hour","Description":"When a Chinese diplomat''s daughter is kidnapped in Los Angeles, he calls in Hong Kong Detective Inspector Lee (Jackie Chan) to assist the FBI with the case. But the FBI doesn''t want anything to do with Lee, and they dump him off on the LAPD, who assign wisecracking Detective James Carter (Chris Tucker) to watch over him. Although Lee and Carter can''t stand each other, they choose to work together to solve the case on their own when they figure out they''ve been ditched by both the FBI and police.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Brett Ratner","Bio":"Brett Ratner is an American film director and producer. He directed the Rush Hour film series, The Family Man, Red Dragon, X-Men: The Last Stand, and Tower Heist. He is also a producer of several films, including the Horrible Bosses series, The Revenant and War Dogs.","Birth":"1968"},"ImagePath":"rush_hour.png","Featured":true}
{"_id":{"$oid":"62d6efbe20613873b1d4edf0"},"Title":"Rush Hour 2","Description":"Carter and Lee head to Hong Kong for a vacation, but become embroiled in a counterfeit money scam.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Brett Ratner","Bio":"Brett Ratner is an American film director and producer. He directed the Rush Hour film series, The Family Man, Red Dragon, X-Men: The Last Stand, and Tower Heist. He is also a producer of several films, including the Horrible Bosses series, The Revenant and War Dogs.","Birth":"1968"},"ImagePath":"rush_hour2.png","Featured":true}
{"_id":{"$oid":"62d6efbe20613873b1d4edf1"},"Title":"Rush Hour 3","Description":"After an attempted assassination on Ambassador Han, Lee and Carter head to Paris to protect a French woman with knowledge of the Triads'' secret leaders.","Genre":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Brett Ratner","Bio":"Brett Ratner is an American film director and producer. He directed the Rush Hour film series, The Family Man, Red Dragon, X-Men: The Last Stand, and Tower Heist. He is also a producer of several films, including the Horrible Bosses series, The Revenant and War Dogs.","Birth":"1968"},"ImagePath":"rush_hour3.png","Featured":true}
{"_id":{"$oid":"62d6efbe20613873b1d4edf2"},"Title":"Crazy Rich Asians","Description":"Rachel Chu is happy to accompany her longtime boyfriend, Nick, to his best friend''s wedding in Singapore. She''s also surprised to learn that Nick's family is extremely wealthy and he''s considered one of the country''s most eligible bachelors. Thrust into the spotlight, Rachel must now contend with jealous socialites, quirky relatives and something far, far worse -- Nick''s disapproving mother.","Genre":{"Name":"Romance","Description":"The romance genre is a popular category of books that consistently churns out bestsellers. The aim of the genre is simple, showcasing a love story where two people overcome adversity to obtain their happily ever after."},"Director":{"Name":"Jon M. Chu","Bio":"Jonathan Murray Chu is an American film director, producer, and screenwriter. He is best known as the director of 2018''s Crazy Rich Asians, the first film by a major Hollywood studio to feature a majority cast of Asian descent in a modern setting since The Joy Luck Club in 1993.","Birth":"1979"},"ImagePath":"CrazyRichAsians.png","Featured":true}
{"_id":{"$oid":"62d6efbe20613873b1d4edf3"},"Title":"Annabelle Comes Home","Description":"Determined to keep Annabelle from wreaking more havoc, paranormal investigators Ed and Lorraine Warren lock the possessed doll in the artifacts room in their house. But when the doll awakens the room's evil spirits, it soon becomes an unholy night of terror for the couple's 10-year-old daughter, her friends and their young baby sitter.","Genre":{"Name":"Horror","Description":"Horror is a film genre that seeks to elicit fear or disgust in its audience for entertainment purposes."},"Director":{"Name":"Gary Dauberman","Bio":"Gary Dauberman is an American screenwriter and director. He is known for writing The Conjuring Universe horror films Annabelle, Annabelle: Creation, The Nun, and Annabelle Comes Home. He made his directorial debut with the latter film.","Birth":"unknown"},"ImagePath":"Annabelle.png","Featured":true}
